MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_WOR.h
#define WOR_CTRL_SCHEDULING_MODE_MASK            (0x2U)
#define WOR_CTRL_SCHEDULING_MODE_SHIFT           (1U)
/*! SCHEDULING_MODE - WAKE-ON-RADIO Scheduling Mode */
#define WOR_CTRL_SCHEDULING_MODE(x)              (((uint32_t)(((uint32_t)(x)) << WOR_CTRL_SCHEDULING_MODE_SHIFT)) & WOR_CTRL_SCHEDULING_MODE_MASK)

#define WOR_CTRL_WOR_PROTOCOL_MASK               (0xCU)
#define WOR_CTRL_WOR_PROTOCOL_SHIFT              (2U)
/*! WOR_PROTOCOL - WAKE-ON-RADIO Protocol Selector */
#define WOR_CTRL_WOR_PROTOCOL(x)                 (((uint32_t)(((uint32_t)(x)) << WOR_CTRL_WOR_PROTOCOL_SHIFT)) & WOR_CTRL_WOR_PROTOCOL_MASK)

#define WOR_CTRL_SLOTS_USED_MASK                 (0x70U)
#define WOR_CTRL_SLOTS_USED_SHIFT                (4U)
/*! SLOTS_USED - WAKE-ON-RADIO Number Of Slots Used */
#define WOR_CTRL_SLOTS_USED(x)                   (((uint32_t)(((uint32_t)(x)) << WOR_CTRL_SLOTS_USED_SHIFT)) & WOR_CTRL_SLOTS_USED_MASK)

#define WOR_CTRL_SKIP_FIRST_DSM_MASK             (0x80U)
#define WOR_CTRL_SKIP_FIRST_DSM_SHIFT            (7U)
/*! SKIP_FIRST_DSM - WAKE-ON-RADIO Skip DSM On First Slot */
#define WOR_CTRL_SKIP_FIRST_DSM(x)               (((uint32_t)(((uint32_t)(x)) << WOR_CTRL_SKIP_FIRST_DSM_SHIFT)) & WOR_CTRL_SKIP_FIRST_DSM_MASK)

#define WOR_CTRL_MAN_DSM_SEL_MASK                (0x300U)
#define WOR_CTRL_MAN_DSM_SEL_SHIFT               (8U)
/*! MAN_DSM_SEL - Manual DSM Selector */
#define WOR_CTRL_MAN_DSM_SEL(x)                  (((uint32_t)(((uint32_t)(x)) << WOR_CTRL_MAN_DSM_SEL_SHIFT)) & WOR_CTRL_MAN_DSM_SEL_MASK)

#define WOR_CTRL_RX_SLOT_FAIL_THRESH_MASK        (0x7C00U)
#define WOR_CTRL_RX_SLOT_FAIL_THRESH_SHIFT       (10U)
/*! RX_SLOT_FAIL_THRESH - RX Slot Fail Thresh */
#define WOR_CTRL_RX_SLOT_FAIL_THRESH(x)          (((uint32_t)(((uint32_t)(x)) << WOR_CTRL_RX_SLOT_FAIL_THRESH_SHIFT)) & WOR_CTRL_RX_SLOT_FAIL_THRESH_MASK)

#define WOR_CTRL_DSM_GUARDBAND_MASK              (0xF0000U)
#define WOR_CTRL_DSM_GUARDBAND_SHIFT             (16U)
/*! DSM_GUARDBAND - WAKE-ON-RADIO DSM Guardband */
#define WOR_CTRL_DSM_GUARDBAND(x)                (((uint32_t)(((uint32_t)(x)) << WOR_CTRL_DSM_GUARDBAND_SHIFT)) & WOR_CTRL_DSM_GUARDBAND_MASK)

#define WOR_CTRL_WOR_RESUME_MASK                 (0x1000000U)
#define WOR_CTRL_WOR_RESUME_SHIFT                (24U)
/*! WOR_RESUME - WAKE-ON-RADIO Resume */
#define WOR_CTRL_WOR_RESUME(x)                   (((uint32_t)(((uint32_t)(x)) << WOR_CTRL_WOR_RESUME_SHIFT)) & WOR_CTRL_WOR_RESUME_MASK)

#define WOR_CTRL_WOR_DEBUG_REG_MASK              (0x2000000U)
#define WOR_CTRL_WOR_DEBUG_REG_SHIFT             (25U)
/*! WOR_DEBUG_REG - WAKE-ON-RADIO Debug Register Enable */
#define WOR_CTRL_WOR_DEBUG_REG(x)                (((uint32_t)(((uint32_t)(x)) << WOR_CTRL_WOR_DEBUG_REG_SHIFT)) & WOR_CTRL_WOR_DEBUG_REG_MASK)

#define WOR_CTRL_AUTO_CAL_MASK                   (0x10000000U)
#define WOR_CTRL_AUTO_CAL_SHIFT                  (28U)
/*! AUTO_CAL - Auto calculate and track the drift enable */
#define WOR_CTRL_AUTO_CAL(x)                     (((uint32_t)(((uint32_t)(x)) << WOR_CTRL_AUTO_CAL_SHIFT)) & WOR_CTRL_AUTO_CAL_MASK)

#define WOR_CTRL_SW_CAL_MASK                     (0x20000000U)
#define WOR_CTRL_SW_CAL_SHIFT                    (29U)
/*! SW_CAL - Enable the WOR SW to calculate the drift. Only when AUTO_CAL is set. */
#define WOR_CTRL_SW_CAL(x)                       (((uint32_t)(((uint32_t)(x)) << WOR_CTRL_SW_CAL_SHIFT)) & WOR_CTRL_SW_CAL_MASK)

#define WOR_CTRL_TIME_REC_MASK                   (0x40000000U)
#define WOR_CTRL_TIME_REC_SHIFT                  (30U)
/*! TIME_REC - Enable the WOR HW to record the timing information to the Packet RAM. */
#define WOR_CTRL_TIME_REC(x)                     (((uint32_t)(((uint32_t)(x)) << WOR_CTRL_TIME_REC_SHIFT)) & WOR_CTRL_TIME_REC_MASK)

#define WOR_CTRL_WOR_RX_FAIL_IRQ_EN_MASK         (0x80000000U)
#define WOR_CTRL_WOR_RX_FAIL_IRQ_EN_SHIFT        (31U)
/*! WOR_RX_FAIL_IRQ_EN - WOR_RX_FAIL_IRQ Enable */
#define WOR_CTRL_WOR_RX_FAIL_IRQ_EN(x)           (((uint32_t)(((uint32_t)(x)) << WOR_CTRL_WOR_RX_FAIL_IRQ_EN_SHIFT)) & WOR_CTRL_WOR_RX_FAIL_IRQ_EN_MASK)
/*! @} */

/*! @name TIMEOUT - WAKE-ON-RADIO TIMEOUT REGISTER */
/*! @{ */

#define WOR_TIMEOUT_RECEIVE_TIMEOUT_MASK         (0xFFFFU)
#define WOR_TIMEOUT_RECEIVE_TIMEOUT_SHIFT        (0U)
/*! RECEIVE_TIMEOUT - WAKE-ON-RADIO Receive Timeout */
#define WOR_TIMEOUT_RECEIVE_TIMEOUT(x)           (((uint32_t)(((uint32_t)(x)) << WOR_TIMEOUT_RECEIVE_TIMEOUT_SHIFT)) & WOR_TIMEOUT_RECEIVE_TIMEOUT_MASK)

#define WOR_TIMEOUT_WAKE_ON_NTH_SLOT_MASK        (0xFF0000U)
#define WOR_TIMEOUT_WAKE_ON_NTH_SLOT_SHIFT       (16U)
/*! WAKE_ON_NTH_SLOT - WAKE-ON-RADIO Force Wake On Nth Slot */
#define WOR_TIMEOUT_WAKE_ON_NTH_SLOT(x)          (((uint32_t)(((uint32_t)(x)) << WOR_TIMEOUT_WAKE_ON_NTH_SLOT_SHIFT)) & WOR_TIMEOUT_WAKE_ON_NTH_SLOT_MASK)

#define WOR_TIMEOUT_WOR_SLOT_COUNT_MASK          (0xFF000000U)
#define WOR_TIMEOUT_WOR_SLOT_COUNT_SHIFT         (24U)
/*! WOR_SLOT_COUNT - WAKE-ON-RADIO Absolute Slot Count */
#define WOR_TIMEOUT_WOR_SLOT_COUNT(x)            (((uint32_t)(((uint32_t)(x)) << WOR_TIMEOUT_WOR_SLOT_COUNT_SHIFT)) & WOR_TIMEOUT_WOR_SLOT_COUNT_MASK)
/*! @} */

/*! @name TIMESTAMP1 - WAKE-ON-RADIO TIMESTAMP 1 */
/*! @{ */

#define WOR_TIMESTAMP1_TIMESTAMP1_MASK           (0xFFFFFFFFU)
#define WOR_TIMESTAMP1_TIMESTAMP1_SHIFT          (0U)
/*! TIMESTAMP1 - WAKE-ON-RADIO TIMESTAMP1 */
#define WOR_TIMESTAMP1_TIMESTAMP1(x)             (((uint32_t)(((uint32_t)(x)) << WOR_TIMESTAMP1_TIMESTAMP1_SHIFT)) & WOR_TIMESTAMP1_TIMESTAMP1_MASK)
/*! @} */

/*! @name TIMESTAMP2 - WAKE-ON-RADIO TIMESTAMP 2 */
/*! @{ */

#define WOR_TIMESTAMP2_TIMESTAMP2_MASK           (0xFFFFFFFFU)
#define WOR_TIMESTAMP2_TIMESTAMP2_SHIFT          (0U)
/*! TIMESTAMP2 - WAKE-ON-RADIO TIMESTAMP2 */
#define WOR_TIMESTAMP2_TIMESTAMP2(x)             (((uint32_t)(((uint32_t)(x)) << WOR_TIMESTAMP2_TIMESTAMP2_SHIFT)) & WOR_TIMESTAMP2_TIMESTAMP2_MASK)
/*! @} */

/*! @name TIMESTAMP3 - WAKE-ON-RADIO TIMESTAMP 3 */
/*! @{ */

#define WOR_TIMESTAMP3_TIMESTAMP3_MASK           (0xFFFFFFFFU)
#define WOR_TIMESTAMP3_TIMESTAMP3_SHIFT          (0U)
/*! TIMESTAMP3 - WAKE-ON-RADIO TIMESTAMP3 */
#define WOR_TIMESTAMP3_TIMESTAMP3(x)             (((uint32_t)(((uint32_t)(x)) << WOR_TIMESTAMP3_TIMESTAMP3_SHIFT)) & WOR_TIMESTAMP3_TIMESTAMP3_MASK)
/*! @} */

/*! @name STATUS - WAKE-ON-RADIO STATUS REGISTER */
/*! @{ */

