MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_WOR.h
#define WOR_STATUS_TIMESTAMP0_STS_MASK           (0x7U)
#define WOR_STATUS_TIMESTAMP0_STS_SHIFT          (0U)
/*! TIMESTAMP0_STS - WAKE-ON-RADIO Timestamp 0 Status */
#define WOR_STATUS_TIMESTAMP0_STS(x)             (((uint32_t)(((uint32_t)(x)) << WOR_STATUS_TIMESTAMP0_STS_SHIFT)) & WOR_STATUS_TIMESTAMP0_STS_MASK)

#define WOR_STATUS_TIMESTAMP1_STS_MASK           (0x38U)
#define WOR_STATUS_TIMESTAMP1_STS_SHIFT          (3U)
/*! TIMESTAMP1_STS - WAKE-ON-RADIO Timestamp 1 Status */
#define WOR_STATUS_TIMESTAMP1_STS(x)             (((uint32_t)(((uint32_t)(x)) << WOR_STATUS_TIMESTAMP1_STS_SHIFT)) & WOR_STATUS_TIMESTAMP1_STS_MASK)

#define WOR_STATUS_TIMESTAMP2_STS_MASK           (0x1C0U)
#define WOR_STATUS_TIMESTAMP2_STS_SHIFT          (6U)
/*! TIMESTAMP2_STS - WAKE-ON-RADIO Timestamp 2 Status */
#define WOR_STATUS_TIMESTAMP2_STS(x)             (((uint32_t)(((uint32_t)(x)) << WOR_STATUS_TIMESTAMP2_STS_SHIFT)) & WOR_STATUS_TIMESTAMP2_STS_MASK)

#define WOR_STATUS_TIMESTAMP3_STS_MASK           (0xE00U)
#define WOR_STATUS_TIMESTAMP3_STS_SHIFT          (9U)
/*! TIMESTAMP3_STS - WAKE-ON-RADIO Timestamp 3 Status */
#define WOR_STATUS_TIMESTAMP3_STS(x)             (((uint32_t)(((uint32_t)(x)) << WOR_STATUS_TIMESTAMP3_STS_SHIFT)) & WOR_STATUS_TIMESTAMP3_STS_MASK)

#define WOR_STATUS_SLOT_MASK                     (0x3000U)
#define WOR_STATUS_SLOT_SHIFT                    (12U)
/*! SLOT - WAKE-ON-RADIO Current Slot */
#define WOR_STATUS_SLOT(x)                       (((uint32_t)(((uint32_t)(x)) << WOR_STATUS_SLOT_SHIFT)) & WOR_STATUS_SLOT_MASK)

#define WOR_STATUS_WOR_NO_RF_FLAG_MASK           (0x10000U)
#define WOR_STATUS_WOR_NO_RF_FLAG_SHIFT          (16U)
/*! WOR_NO_RF_FLAG - WAKE-ON-RADIO NO_RF Slot Flag */
#define WOR_STATUS_WOR_NO_RF_FLAG(x)             (((uint32_t)(((uint32_t)(x)) << WOR_STATUS_WOR_NO_RF_FLAG_SHIFT)) & WOR_STATUS_WOR_NO_RF_FLAG_MASK)

#define WOR_STATUS_WOR_MAX_SLOT_FLAG_MASK        (0x20000U)
#define WOR_STATUS_WOR_MAX_SLOT_FLAG_SHIFT       (17U)
/*! WOR_MAX_SLOT_FLAG - WAKE-ON-RADIO Maximum Slot Count Reached Flag */
#define WOR_STATUS_WOR_MAX_SLOT_FLAG(x)          (((uint32_t)(((uint32_t)(x)) << WOR_STATUS_WOR_MAX_SLOT_FLAG_SHIFT)) & WOR_STATUS_WOR_MAX_SLOT_FLAG_MASK)

#define WOR_STATUS_WOR_DSM_EXIT_FLAG_MASK        (0x40000U)
#define WOR_STATUS_WOR_DSM_EXIT_FLAG_SHIFT       (18U)
/*! WOR_DSM_EXIT_FLAG - WAKE-ON-RADIO Early DSM Exit Flag */
#define WOR_STATUS_WOR_DSM_EXIT_FLAG(x)          (((uint32_t)(((uint32_t)(x)) << WOR_STATUS_WOR_DSM_EXIT_FLAG_SHIFT)) & WOR_STATUS_WOR_DSM_EXIT_FLAG_MASK)

#define WOR_STATUS_WOR_STATE_MASK                (0xF00000U)
#define WOR_STATUS_WOR_STATE_SHIFT               (20U)
/*! WOR_STATE - WAKE-ON-RADIO Current State */
#define WOR_STATUS_WOR_STATE(x)                  (((uint32_t)(((uint32_t)(x)) << WOR_STATUS_WOR_STATE_SHIFT)) & WOR_STATUS_WOR_STATE_MASK)

#define WOR_STATUS_WOR_RX_FAIL_IRQ_MASK          (0x80000000U)
#define WOR_STATUS_WOR_RX_FAIL_IRQ_SHIFT         (31U)
/*! WOR_RX_FAIL_IRQ - WOR RX Fail Interrupt Flag */
#define WOR_STATUS_WOR_RX_FAIL_IRQ(x)            (((uint32_t)(((uint32_t)(x)) << WOR_STATUS_WOR_RX_FAIL_IRQ_SHIFT)) & WOR_STATUS_WOR_RX_FAIL_IRQ_MASK)
/*! @} */

/*! @name WW_CTRL - WINDOW-WIDENING CONTROL REGISTER */
/*! @{ */

#define WOR_WW_CTRL_WW_EN_MASK                   (0x1U)
#define WOR_WW_CTRL_WW_EN_SHIFT                  (0U)
/*! WW_EN - Window-widening Enable */
#define WOR_WW_CTRL_WW_EN(x)                     (((uint32_t)(((uint32_t)(x)) << WOR_WW_CTRL_WW_EN_SHIFT)) & WOR_WW_CTRL_WW_EN_MASK)

#define WOR_WW_CTRL_WW_RESET_ON_RX_MASK          (0x2U)
#define WOR_WW_CTRL_WW_RESET_ON_RX_SHIFT         (1U)
/*! WW_RESET_ON_RX - Window-widening Reset on Received Good Packet */
#define WOR_WW_CTRL_WW_RESET_ON_RX(x)            (((uint32_t)(((uint32_t)(x)) << WOR_WW_CTRL_WW_RESET_ON_RX_SHIFT)) & WOR_WW_CTRL_WW_RESET_ON_RX_MASK)

#define WOR_WW_CTRL_WW_NULL_MASK                 (0x4U)
#define WOR_WW_CTRL_WW_NULL_SHIFT                (2U)
/*! WW_NULL - Window-widening Null Command */
#define WOR_WW_CTRL_WW_NULL(x)                   (((uint32_t)(((uint32_t)(x)) << WOR_WW_CTRL_WW_NULL_SHIFT)) & WOR_WW_CTRL_WW_NULL_MASK)

#define WOR_WW_CTRL_WW_ADD_MASK                  (0x8U)
#define WOR_WW_CTRL_WW_ADD_SHIFT                 (3U)
/*! WW_ADD - Window-widening Add Command */
#define WOR_WW_CTRL_WW_ADD(x)                    (((uint32_t)(((uint32_t)(x)) << WOR_WW_CTRL_WW_ADD_SHIFT)) & WOR_WW_CTRL_WW_ADD_MASK)

#define WOR_WW_CTRL_WW_DSM_FACTOR_MASK           (0x3F00U)
#define WOR_WW_CTRL_WW_DSM_FACTOR_SHIFT          (8U)
/*! WW_DSM_FACTOR - Window-widening DSM Factor */
#define WOR_WW_CTRL_WW_DSM_FACTOR(x)             (((uint32_t)(((uint32_t)(x)) << WOR_WW_CTRL_WW_DSM_FACTOR_SHIFT)) & WOR_WW_CTRL_WW_DSM_FACTOR_MASK)

#define WOR_WW_CTRL_WW_RUN_FACTOR_MASK           (0x1F0000U)
#define WOR_WW_CTRL_WW_RUN_FACTOR_SHIFT          (16U)
/*! WW_RUN_FACTOR - Window-widening Runtime Factor */
#define WOR_WW_CTRL_WW_RUN_FACTOR(x)             (((uint32_t)(((uint32_t)(x)) << WOR_WW_CTRL_WW_RUN_FACTOR_SHIFT)) & WOR_WW_CTRL_WW_RUN_FACTOR_MASK)

#define WOR_WW_CTRL_WW_INCREASE_MASK             (0xFF000000U)
#define WOR_WW_CTRL_WW_INCREASE_SHIFT            (24U)
/*! WW_INCREASE - Window-widening Manual Increase Amount */
#define WOR_WW_CTRL_WW_INCREASE(x)               (((uint32_t)(((uint32_t)(x)) << WOR_WW_CTRL_WW_INCREASE_SHIFT)) & WOR_WW_CTRL_WW_INCREASE_MASK)
/*! @} */

/*! @name HOP_CTRL - FREQUENCY HOP CONTROL REGISTER */
/*! @{ */

#define WOR_HOP_CTRL_HOP_TBL_CFG_MASK            (0x7U)
#define WOR_HOP_CTRL_HOP_TBL_CFG_SHIFT           (0U)
/*! HOP_TBL_CFG - Hop Table Configuration */
#define WOR_HOP_CTRL_HOP_TBL_CFG(x)              (((uint32_t)(((uint32_t)(x)) << WOR_HOP_CTRL_HOP_TBL_CFG_SHIFT)) & WOR_HOP_CTRL_HOP_TBL_CFG_MASK)

#define WOR_HOP_CTRL_NEW_HOP_IDX_MASK            (0x7F00U)
#define WOR_HOP_CTRL_NEW_HOP_IDX_SHIFT           (8U)
/*! NEW_HOP_IDX - New Hop Table Index */
#define WOR_HOP_CTRL_NEW_HOP_IDX(x)              (((uint32_t)(((uint32_t)(x)) << WOR_HOP_CTRL_NEW_HOP_IDX_SHIFT)) & WOR_HOP_CTRL_NEW_HOP_IDX_MASK)

#define WOR_HOP_CTRL_UPDATE_HOP_IDX_MASK         (0x8000U)
#define WOR_HOP_CTRL_UPDATE_HOP_IDX_SHIFT        (15U)
/*! UPDATE_HOP_IDX - Up2025-05-16 Hop Table Index */
#define WOR_HOP_CTRL_UPDATE_HOP_IDX(x)           (((uint32_t)(((uint32_t)(x)) << WOR_HOP_CTRL_UPDATE_HOP_IDX_SHIFT)) & WOR_HOP_CTRL_UPDATE_HOP_IDX_MASK)

