MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_WOR.h
#define WOR_HOP_CTRL_HOP_SEQ_LENGTH_MASK         (0xFF0000U)
#define WOR_HOP_CTRL_HOP_SEQ_LENGTH_SHIFT        (16U)
/*! HOP_SEQ_LENGTH - New Hop Table Index */
#define WOR_HOP_CTRL_HOP_SEQ_LENGTH(x)           (((uint32_t)(((uint32_t)(x)) << WOR_HOP_CTRL_HOP_SEQ_LENGTH_SHIFT)) & WOR_HOP_CTRL_HOP_SEQ_LENGTH_MASK)
/*! @} */

/*! @name SLOT0_DESC0 - SLOT 0 DESCRIPTOR (LSB) */
/*! @{ */

#define WOR_SLOT0_DESC0_SLOT0_DESC0_MASK         (0xFFFFFFFFU)
#define WOR_SLOT0_DESC0_SLOT0_DESC0_SHIFT        (0U)
/*! SLOT0_DESC0 - Slot 0 Descriptor (LSB's) */
#define WOR_SLOT0_DESC0_SLOT0_DESC0(x)           (((uint32_t)(((uint32_t)(x)) << WOR_SLOT0_DESC0_SLOT0_DESC0_SHIFT)) & WOR_SLOT0_DESC0_SLOT0_DESC0_MASK)
/*! @} */

/*! @name SLOT0_DESC1 - SLOT 0 DESCRIPTOR (MSB) */
/*! @{ */

#define WOR_SLOT0_DESC1_SLOT0_DESC1_MASK         (0x3FU)
#define WOR_SLOT0_DESC1_SLOT0_DESC1_SHIFT        (0U)
/*! SLOT0_DESC1 - Slot 0 Descriptor (MSB's) */
#define WOR_SLOT0_DESC1_SLOT0_DESC1(x)           (((uint32_t)(((uint32_t)(x)) << WOR_SLOT0_DESC1_SLOT0_DESC1_SHIFT)) & WOR_SLOT0_DESC1_SLOT0_DESC1_MASK)

#define WOR_SLOT0_DESC1_WOR_HOP_IDX_MASK         (0x7F00U)
#define WOR_SLOT0_DESC1_WOR_HOP_IDX_SHIFT        (8U)
/*! WOR_HOP_IDX - Current Hop Table Index */
#define WOR_SLOT0_DESC1_WOR_HOP_IDX(x)           (((uint32_t)(((uint32_t)(x)) << WOR_SLOT0_DESC1_WOR_HOP_IDX_SHIFT)) & WOR_SLOT0_DESC1_WOR_HOP_IDX_MASK)

#define WOR_SLOT0_DESC1_WOR_HOP_FREQ_WORD_MASK   (0xFFFF0000U)
#define WOR_SLOT0_DESC1_WOR_HOP_FREQ_WORD_SHIFT  (16U)
/*! WOR_HOP_FREQ_WORD - Current Hop Frequency Word */
#define WOR_SLOT0_DESC1_WOR_HOP_FREQ_WORD(x)     (((uint32_t)(((uint32_t)(x)) << WOR_SLOT0_DESC1_WOR_HOP_FREQ_WORD_SHIFT)) & WOR_SLOT0_DESC1_WOR_HOP_FREQ_WORD_MASK)
/*! @} */

/*! @name SLOT1_DESC0 - SLOT 1 DESCRIPTOR (LSB) */
/*! @{ */

#define WOR_SLOT1_DESC0_SLOT1_DESC0_MASK         (0xFFFFFFFFU)
#define WOR_SLOT1_DESC0_SLOT1_DESC0_SHIFT        (0U)
/*! SLOT1_DESC0 - Slot 1 Descriptor (LSB's) */
#define WOR_SLOT1_DESC0_SLOT1_DESC0(x)           (((uint32_t)(((uint32_t)(x)) << WOR_SLOT1_DESC0_SLOT1_DESC0_SHIFT)) & WOR_SLOT1_DESC0_SLOT1_DESC0_MASK)
/*! @} */

/*! @name SLOT1_DESC1 - SLOT 1 DESCRIPTOR (MSB) */
/*! @{ */

#define WOR_SLOT1_DESC1_SLOT1_DESC1_MASK         (0x3FU)
#define WOR_SLOT1_DESC1_SLOT1_DESC1_SHIFT        (0U)
/*! SLOT1_DESC1 - Slot 1 Descriptor (MSB's) */
#define WOR_SLOT1_DESC1_SLOT1_DESC1(x)           (((uint32_t)(((uint32_t)(x)) << WOR_SLOT1_DESC1_SLOT1_DESC1_SHIFT)) & WOR_SLOT1_DESC1_SLOT1_DESC1_MASK)
/*! @} */

/*! @name SLOT2_DESC0 - SLOT 2 DESCRIPTOR (LSB) */
/*! @{ */

#define WOR_SLOT2_DESC0_SLOT2_DESC0_MASK         (0xFFFFFFFFU)
#define WOR_SLOT2_DESC0_SLOT2_DESC0_SHIFT        (0U)
/*! SLOT2_DESC0 - Slot 2 Descriptor (LSB's) */
#define WOR_SLOT2_DESC0_SLOT2_DESC0(x)           (((uint32_t)(((uint32_t)(x)) << WOR_SLOT2_DESC0_SLOT2_DESC0_SHIFT)) & WOR_SLOT2_DESC0_SLOT2_DESC0_MASK)
/*! @} */

/*! @name SLOT2_DESC1 - SLOT 2 DESCRIPTOR (MSB) */
/*! @{ */

#define WOR_SLOT2_DESC1_SLOT2_DESC1_MASK         (0x3FU)
#define WOR_SLOT2_DESC1_SLOT2_DESC1_SHIFT        (0U)
/*! SLOT2_DESC1 - Slot 2 Descriptor (MSB's) */
#define WOR_SLOT2_DESC1_SLOT2_DESC1(x)           (((uint32_t)(((uint32_t)(x)) << WOR_SLOT2_DESC1_SLOT2_DESC1_SHIFT)) & WOR_SLOT2_DESC1_SLOT2_DESC1_MASK)
/*! @} */

/*! @name SLOT3_DESC0 - SLOT 3 DESCRIPTOR (LSB) */
/*! @{ */

#define WOR_SLOT3_DESC0_SLOT3_DESC0_MASK         (0xFFFFFFFFU)
#define WOR_SLOT3_DESC0_SLOT3_DESC0_SHIFT        (0U)
/*! SLOT3_DESC0 - Slot 3 Descriptor (LSB's) */
#define WOR_SLOT3_DESC0_SLOT3_DESC0(x)           (((uint32_t)(((uint32_t)(x)) << WOR_SLOT3_DESC0_SLOT3_DESC0_SHIFT)) & WOR_SLOT3_DESC0_SLOT3_DESC0_MASK)
/*! @} */

/*! @name SLOT3_DESC1 - SLOT 3 DESCRIPTOR (MSB) */
/*! @{ */

#define WOR_SLOT3_DESC1_SLOT3_DESC1_MASK         (0x3FU)
#define WOR_SLOT3_DESC1_SLOT3_DESC1_SHIFT        (0U)
/*! SLOT3_DESC1 - Slot 3 Descriptor (MSB's) */
#define WOR_SLOT3_DESC1_SLOT3_DESC1(x)           (((uint32_t)(((uint32_t)(x)) << WOR_SLOT3_DESC1_SLOT3_DESC1_SHIFT)) & WOR_SLOT3_DESC1_SLOT3_DESC1_MASK)
/*! @} */

/*! @name AUTO_DRIFT1 - Auto Drift Calculation Register 1 */
/*! @{ */

#define WOR_AUTO_DRIFT1_SW_DRIFT_SET_MASK        (0x7FU)
#define WOR_AUTO_DRIFT1_SW_DRIFT_SET_SHIFT       (0U)
/*! SW_DRIFT_SET - Software calculated drift. */
#define WOR_AUTO_DRIFT1_SW_DRIFT_SET(x)          (((uint32_t)(((uint32_t)(x)) << WOR_AUTO_DRIFT1_SW_DRIFT_SET_SHIFT)) & WOR_AUTO_DRIFT1_SW_DRIFT_SET_MASK)

#define WOR_AUTO_DRIFT1_CAL_DSM_FACTOR_MASK      (0x7F0000U)
#define WOR_AUTO_DRIFT1_CAL_DSM_FACTOR_SHIFT     (16U)
/*! CAL_DSM_FACTOR - Hardware calculated drift. */
#define WOR_AUTO_DRIFT1_CAL_DSM_FACTOR(x)        (((uint32_t)(((uint32_t)(x)) << WOR_AUTO_DRIFT1_CAL_DSM_FACTOR_SHIFT)) & WOR_AUTO_DRIFT1_CAL_DSM_FACTOR_MASK)
/*! @} */

/*! @name AUTO_DRIFT2 - Auto Drift Calculation Register 2 */
/*! @{ */

#define WOR_AUTO_DRIFT2_AA_SFD_DLY_MASK          (0xFFFFU)
#define WOR_AUTO_DRIFT2_AA_SFD_DLY_SHIFT         (0U)
/*! AA_SFD_DLY - The time duration of Preamble and Sync Address plus the RX warm up duration. */
#define WOR_AUTO_DRIFT2_AA_SFD_DLY(x)            (((uint32_t)(((uint32_t)(x)) << WOR_AUTO_DRIFT2_AA_SFD_DLY_SHIFT)) & WOR_AUTO_DRIFT2_AA_SFD_DLY_MASK)
/*! @} */

/*! @name AUTO_DRIFT3 - Auto Drift Calculation Register 3 */
/*! @{ */

#define WOR_AUTO_DRIFT3_TIME_MGN_MASK            (0xFFFFU)
#define WOR_AUTO_DRIFT3_TIME_MGN_SHIFT           (0U)
/*! TIME_MGN - The time margin applied to the start time and timeout. */
#define WOR_AUTO_DRIFT3_TIME_MGN(x)              (((uint32_t)(((uint32_t)(x)) << WOR_AUTO_DRIFT3_TIME_MGN_SHIFT)) & WOR_AUTO_DRIFT3_TIME_MGN_MASK)
/*! @} */

/*! @name AUTO_DRIFT4 - Auto Drift Calculation Register 4 */
/*! @{ */

#define WOR_AUTO_DRIFT4_TINT_DIV_MILLION_MASK    (0xFFFFFFU)
#define WOR_AUTO_DRIFT4_TINT_DIV_MILLION_SHIFT   (0U)
#define WOR_AUTO_DRIFT4_TINT_DIV_MILLION(x)      (((uint32_t)(((uint32_t)(x)) << WOR_AUTO_DRIFT4_TINT_DIV_MILLION_SHIFT)) & WOR_AUTO_DRIFT4_TINT_DIV_MILLION_MASK)
/*! @} */

